app/controllers/avaliacaos_controller.rb

SELECT "avaliacaos".* FROM "avaliacaos"
---
  def index
    @avaliacaos = Avaliacao.all

INSERT INTO "avaliacaos" ("avaliacao_texto", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["avaliacao_texto", "MyText"], ["created_at", "2019-10-09 14:02:46.444731"], ["updated_at", "2019-10-09 14:02:46.444731"]]
---
  def create
    @avaliacao = Avaliacao.new(avaliacao_params)

    respond_to do |format|
      if @avaliacao.save

DELETE FROM "avaliacaos" WHERE "avaliacaos"."id" = $1  [["id", 980190962]]
---
  def destroy
    @avaliacao.destroy

SELECT "avaliacaos".* FROM "avaliacaos" WHERE "avaliacaos"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_avaliacao
      @avaliacao = Avaliacao.find(params[:id])