app/controllers/contatos_controller.rb

  def index
    @contatos = Contato.all
---
SELECT "contatos".* FROM "contatos"

  def create
    @contato = Contato.new(contato_params)

    respond_to do |format|
      if @contato.save
---
INSERT INTO "contatos" ("nome_contato", "email_contato", "telefone", "texto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome_contato", "MyText"], ["email_contato", "MyText"], ["telefone", 1], ["texto", "MyText"], ["created_at", "2019-10-09 14:02:46.385847"], ["updated_at", "2019-10-09 14:02:46.385847"]]

  def destroy
    @contato.destroy
---
DELETE FROM "contatos" WHERE "contatos"."id" = $1  [["id", 980190962]]

    def set_contato
      @contato = Contato.find(params[:id])
---
SELECT "contatos".* FROM "contatos" WHERE "contatos"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]