app/controllers/estabelecimentos_controller.rb

SELECT "estabelecimentos".* FROM "estabelecimentos"
---
  def index
    @estabelecimentos = Estabelecimento.all

INSERT INTO "estabelecimentos" ("nome", "nome_proprietario", "email", "senha", "descricao", "capacidade", "endereco", "numero", "cidade", "estado", "pais", "cnpj", "telefone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @estabelecimento = Estabelecimento.new(estabelecimento_params)

    respond_to do |format|
      if @estabelecimento.save

DELETE FROM "estabelecimentos" WHERE "estabelecimentos"."id" = $1  [["id", 980190962]]
---
  def destroy
    @estabelecimento.destroy

SELECT "estabelecimentos".* FROM "estabelecimentos" WHERE "estabelecimentos"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_estabelecimento
      @estabelecimento = Estabelecimento.find(params[:id])