app/controllers/eventos_controller.rb

SELECT "eventos".* FROM "eventos"
---
  def index
    @eventos = Evento.all

INSERT INTO "eventos" ("nome", "data_evento", "capacidade", "descricao", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "MyString"], ["data_evento", "2019-10-08 00:00:00"], ["capacidade", 1], ["descricao", "MyText"], ["created_at", "2019-10-09 14:02:57.224888"], ["updated_at", "2019-10-09 14:02:57.224888"]]
---
  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save

DELETE FROM "eventos" WHERE "eventos"."id" = $1  [["id", 980190962]]
---
  def destroy
    @evento.destroy

SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_evento
      @evento = Evento.find(params[:id])