app/controllers/generos_controller.rb

  def index
    @generos = Genero.all
---
SELECT "generos".* FROM "generos"

  def create
    @genero = Genero.new(genero_params)

    respond_to do |format|
      if @genero.save
---
INSERT INTO "generos" ("nome_genero", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome_genero", "MyText"], ["created_at", "2019-10-09 14:02:56.930012"], ["updated_at", "2019-10-09 14:02:56.930012"]]

  def destroy
    @genero.destroy
---
DELETE FROM "generos" WHERE "generos"."id" = $1  [["id", 980190962]]

    def set_genero
      @genero = Genero.find(params[:id])
---
SELECT "generos".* FROM "generos" WHERE "generos"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]