app/controllers/grupo_musicals_controller.rb

  def index
    @grupo_musicals = GrupoMusical.all
---
SELECT "grupo_musicals".* FROM "grupo_musicals"

  def create
    @grupo_musical = GrupoMusical.new(grupo_musical_params)

    respond_to do |format|
      if @grupo_musical.save
---
INSERT INTO "grupo_musicals" ("nome", "sobrenome", "nome_artistico", "email", "senha", "data_nascimento", "endereco", "numero", "cep", "cidade", "estado", "pais", "telefone", "biografia", "salario_hora", "imagens", "video", "cpf", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"

  def destroy
    @grupo_musical.destroy
---
DELETE FROM "grupo_musicals" WHERE "grupo_musicals"."id" = $1  [["id", 980190962]]

    def set_grupo_musical
      @grupo_musical = GrupoMusical.find(params[:id])
---
SELECT "grupo_musicals".* FROM "grupo_musicals" WHERE "grupo_musicals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]