app/controllers/instrumentos_controller.rb

  def index
    @instrumentos = Instrumento.all
---
SELECT "instrumentos".* FROM "instrumentos"

  def create
    @instrumento = Instrumento.new(instrumento_params)

    respond_to do |format|
      if @instrumento.save
---
INSERT INTO "instrumentos" ("nome_instrumento", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome_instrumento", "MyText"], ["created_at", "2019-10-09 14:02:56.648231"], ["updated_at", "2019-10-09 14:02:56.648231"]]

  def destroy
    @instrumento.destroy
---
DELETE FROM "instrumentos" WHERE "instrumentos"."id" = $1  [["id", 980190962]]

    def set_instrumento
      @instrumento = Instrumento.find(params[:id])
---
SELECT "instrumentos".* FROM "instrumentos" WHERE "instrumentos"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]