app/controllers/negociacaos_controller.rb

  def index
    @negociacaos = Negociacao.all
---
SELECT "negociacaos".* FROM "negociacaos"

  def create
    @negociacao = Negociacao.new(negociacao_params)

    respond_to do |format|
      if @negociacao.save
---
INSERT INTO "negociacaos" ("salario_combinado", "status_negociacao", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["salario_combinado", 1.5], ["status_negociacao", "MyString"], ["created_at", "2019-10-09 14:02:46.540401"], ["updated_at", "2019-10-09 14:02:46.540401"]]

  def destroy
    @negociacao.destroy
---
DELETE FROM "negociacaos" WHERE "negociacaos"."id" = $1  [["id", 980190962]]

    def set_negociacao
      @negociacao = Negociacao.find(params[:id])
---
SELECT "negociacaos".* FROM "negociacaos" WHERE "negociacaos"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]