app/controllers/redes_controller.rb

SELECT "redes".* FROM "redes"
---
  def index
    @redes = Rede.all

INSERT INTO "redes" ("nome_rede", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome_rede", "MyText"], ["created_at", "2019-10-09 14:02:57.030414"], ["updated_at", "2019-10-09 14:02:57.030414"]]
---
  def create
    @rede = Rede.new(rede_params)

    respond_to do |format|
      if @rede.save

DELETE FROM "redes" WHERE "redes"."id" = $1  [["id", 980190962]]
---
  def destroy
    @rede.destroy

SELECT "redes".* FROM "redes" WHERE "redes"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_rede
      @rede = Rede.find(params[:id])