app/controllers/tipo_estabelecimentos_controller.rb

SELECT "tipo_estabelecimentos".* FROM "tipo_estabelecimentos"
---
  def index
    @tipo_estabelecimentos = TipoEstabelecimento.all

INSERT INTO "tipo_estabelecimentos" ("nome_tipo", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome_tipo", "MyText"], ["created_at", "2019-10-09 14:02:56.765349"], ["updated_at", "2019-10-09 14:02:56.765349"]]
---
  def create
    @tipo_estabelecimento = TipoEstabelecimento.new(tipo_estabelecimento_params)

    respond_to do |format|
      if @tipo_estabelecimento.save

DELETE FROM "tipo_estabelecimentos" WHERE "tipo_estabelecimentos"."id" = $1  [["id", 980190962]]
---
  def destroy
    @tipo_estabelecimento.destroy

SELECT "tipo_estabelecimentos".* FROM "tipo_estabelecimentos" WHERE "tipo_estabelecimentos"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_tipo_estabelecimento
      @tipo_estabelecimento = TipoEstabelecimento.find(params[:id])